//1. Вывести на экран первую букву имени из символов "*"(звёздочка).
#include <iostream>

int main() {
	std::cout << "*   *" << std::endl
		<< "*  *" << std::endl
		<< "* *" << std::endl
		<< "*  *" << std::endl
		<< "*   *" << std::endl;
	return 0;
}