//1. Вывести на экран Первую букву имени из символов "*" (звездочка).
#include <iostream>

int main() {
	std::cout << "*   *" << std::endl
		<< "*  *" << std::endl
		<< "* *" << std::endl
		<< "*  *" << std::endl
		<< "*   *" << std::endl;
	return 0;
}