// 9. Сделать конвертер величин. Формат ввода: Направление_Перевода Величина
//  f. Давление (паскаль, бар, фунт на квадратный дюйм)

#include <iostream>

int main()
{
    int I;
    float x;
    setlocale(LC_ALL, "Rus");
    std::cout << "Введите направление перевода" << "\n" << "1-Паскаль в Бар" << "\n" << "2-Паскаль в Фунт" << "\n" << "3-Бар в Паскаль" << "\n" << "4-Бар в Фунт" << "\n" << "5-Фунт в Паскаль" << "\n" << "6-Фунт в Бар" << std::endl;
    std::cin >> I;
    std::cout << "Введите число для перевода" << std::endl;
    std::cin >> x;
    if (I == 1) {
        x = x * 0.00001;
        std::cout << x << " Бар";
    };
    if (I == 2) {
        x = x * 0.000145;
        std::cout << x << " Фунт на квадратный дюйм";
    };
    if (I == 3) {
        x = x * 100000;
        std::cout << x << " Паскаль";
    };
    if (I == 4) {
        x = x * 14.5;
        std::cout << x << " Фунт на квадратный дюйм";
    };
    if (I == 5) {
        x = x * 6894.76;
        std::cout << x << " Паскаль";
    };
    if (I == 6) {
        x = x * 0.069;
        std::cout << x << " Бар";
    }
}
